[
  {
    "image_name": "msgLogo",
    "experience_type": "WORK",
    "start_month": "AUG",
    "start_year": 2023,
    "title": "IT Consultant",
    "type": "Full time",
    "location": "Frankfurt, Germany",
    "description": "I am currently employed as a software developer and IT consultant at msg for banking AG, where I contribute to developing and optimizing software solutions for the banking sector.",
    "tasks": [
      "Collaborate with cross-functional teams to design, develop, and implement software solutions tailored to meet the specific needs of the banking industry",
      "Actively participate in the entire software development life cycle, from concept and design to testing, deployment, and maintenance",
      "Utilize programming languages and frameworks such as Python, Typescript and SQL to code and implement software applications"
    ]
  },
  {
    "image_name": "porscheLogo",
    "experience_type": "WORK",
    "start_month": "MAY",
    "start_year": 2022,
    "end_month": "DEC",
    "end_year": 2022,
    "title": "Computer Vision Researcher",
    "type": "Masterand",
    "location": "Weissach, Germany",
    "description": "In the final phase of my academic journey, I partnered with Porsche AG to explore human anticipation behavior, contributing to the advancement of AI-based object recognition methods.",
    "tasks": [
      "Masterand in the field of autonomous and highly automated driving",
      "Title of my Masterthesis: Statistical analysis of human anticipation ability at night-time vehicle detection for further development of object recognition methods."
    ]
  },
  {
    "image_name": "porscheEngineeringLogo",
    "experience_type": "WORK",
    "start_month": "OCT",
    "start_year": 2020,
    "end_month": "SEP",
    "end_year": 2021,
    "title": "Software Quality- and Process Manager",
    "type": "Trainee",
    "location": "Bietigheim-Bissingen, Germany",
    "description": "During my internship at Porsche Engineering I worked on different topics to improve and assure the software quality in the automotive industry.",
    "tasks": [
      "Support of the software quality managers in a customer project to implement ASPICE Level 2 processes",
      "Work with the agile process team during piloting of machine learning software processes"
    ]
  },
  {
    "image_name": "sophisticatesLogo",
    "experience_type": "WORK",
    "start_month": "SEP",
    "start_year": 2019,
    "end_month": "SEP",
    "end_year": 2021,
    "title": "Full Stack Developer",
    "type": "Working Student",
    "location": "Würzburg, Germany",
    "description": "As a full-stack developer, I worked in the design, development, and deployment of end-to-end solutions. Leveraging a comprehensive skill set, I seamlessly bridged the gap between front-end and back-end development, ensuring the creation and improvement of robust and user-friendly applications.",
    "tasks": [
      "Full-Stack development of cloud-based web applications with Ruby on Rails, hosted on AWS Servers",
      "Conception and development of ideas to simplify processes with the help of modern software solutions",
      "Coordination of the project flow from requirements analysis to software Go-Live"
    ]
  },
  {
    "image_name": "teleAktivLogo",
    "experience_type": "WORK",
    "start_month": "DEC",
    "start_year": 2017,
    "end_month": "AUG",
    "end_year": 2019,
    "title": "Data Quality Analyst",
    "type": "Working Student",
    "location": "Würzburg, Germany",
    "description": "",
    "tasks": []
  },
  {
    "image_name": "teleAktivLogo",
    "experience_type": "WORK",
    "start_month": "NOV",
    "start_year": 2018,
    "end_month": "MAR",
    "end_year": 2019,
    "title": "Data Quality Researcher",
    "type": "Bachelorand",
    "location": "Würzburg, Germany",
    "description": "",
    "tasks": []
  }
]
